In [1]:
import pandas as pd

In [2]:
from io import StringIO

In [3]:
import numpy as np

<H3> Required file is: Raptor-Students.csv

In [4]:
NVStudents = pd.read_csv("Raptor-Students.csv", encoding='latin-1')

In [5]:
NVStudents.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20773 entries, 0 to 20772
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   School Number      20773 non-null  int64
 1   Student Number     20773 non-null  int64
 2   S Last Name        20773 non-null  object
 3   S First Name       20773 non-null  object
 4   S Middle Name      18624 non-null  object
 5   Gender             20773 non-null  object
 6   DOB                20773 non-null  object
 7   Grade              20773 non-null  object
 8   Relationship       20763 non-null  object
 9   C Last Name        20773 non-null  object
 10  C First Name       20773 non-null  object
 11  C Middle Name      3761 non-null   object
 12  Mobile Phone       20773 non-null  object
 13  contacts.email     12239 non-null  object
 14  contacts.seq       19419 non-null  float64
 15  contacts.guardian  20181 non-null  float64
 16  student.personID   20773 non-null  int64
dtypes: float64(2), int64(3), object(12)
memory usage: 2.7+ MB

In [6]:
NVStudents

,School Number,Student Number,S Last Name,S First Name,S Middle Name,Gender,DOB,Grade,Relationship,C Last Name,C First Name,C Middle Name,Mobile Phone,contacts.email,contacts.seq,contacts.guardian,student.personID
0,39438,19370,Adams,Sovereign,Delon,M,09/10/2015,01,Mother,Hanks,Shannon,NaN,(702)716-1154,shanks7289@yahoo.com,1.0,1.0,37921
1,39438,19370,Adams,Sovereign,Delon,M,09/10/2015,01,Father,Adams,Alonzo,NaN,(702)556-6396,Alonzoadams35@yahoo.com,2.0,1.0,37921
2,39438,19370,Adams,Sovereign,Delon,M,09/10/2015,01,Emergency Contact,Scott,Cori,NaN,(702)955-6667,NaN,3.0,0.0,37921
3,39438,17235,Adar,Zebidiah,Asher,M,11/18/2014,01,Mother,Adar,Elizabeth,NaN,(702)285-6334,ms.adar90@gmail.com,1.0,1.0,28890
4,39438,17235,Adar,Zebidiah,Asher,M,11/18/2014,01,Grandparent,Adar,Ani,NaN,(702)767-6446,NaN,2.0,0.0,28890
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20768,39440,18923,Zhang,Chloe,NaN,F,04/12/2016,0K,Father,Zhang,Wang,NaN,(312)375-6088,wangzhang20@hotmail.com,2.0,1.0,35292
20769,39440,18923,Zhang,Chloe,NaN,F,04/12/2016,0K,Emergency Contact,Capolingua,Dana,NaN,(702)234-8081,NaN,3.0,0.0,35292
20770,39440,18949,Zhao,Esther,NaN,F,03/25/2016,0K,Mother,Ma,Yuping,NaN,(702)882-6118,suki1991127@gmail.com,1.0,1.0,35383
20771,39440,18949,Zhao,Esther,NaN,F,03/25/2016,0K,Father,Zhao,Chun,Kai,(702)782-7077,NaN,3.0,1.0,35383
20772,39440,18949,Zhao,Esther,NaN,F,03/25/2016,0K,Emergency Contact,Zhang,Huanhuan,NaN,(702)677-1991,NaN,2.0,0.0,35383

MailingList.rename(columns={'STUDENTS.SchoolID': 'school_sis_id', 'STUDENTS.Grade_Level': 'grade', 'Email Address': 'email'}, inplace=True)

In [7]:
NVMailingList = NVStudents.filter(['School Number','Grade','contacts.email', 'contacts.guardian'])

In [8]:
NVMailingList

       School Number Grade           contacts.email  contacts.guardian
0              39438    01     shanks7289@yahoo.com                1.0
1              39438    01  Alonzoadams35@yahoo.com                1.0
2              39438    01                      NaN                0.0
3              39438    01      ms.adar90@gmail.com                1.0
4              39438    01                      NaN                0.0
...              ...   ...                      ...                ...
20768          39440    0K  wangzhang20@hotmail.com                1.0
20769          39440    0K                      NaN                0.0
20770          39440    0K    suki1991127@gmail.com                1.0
20771          39440    0K                      NaN                1.0
20772          39440    0K                      NaN                0.0

[20773 rows x 4 columns]

In [9]:
NVMailingList.rename(columns={'School Number': 'school_sis_id', 'Grade':'grade', 'contacts.email': 'email'}, inplace=True)

In [10]:
NVMailingList

       school_sis_id grade                    email  contacts.guardian
0              39438    01     shanks7289@yahoo.com                1.0
1              39438    01  Alonzoadams35@yahoo.com                1.0
2              39438    01                      NaN                0.0
3              39438    01      ms.adar90@gmail.com                1.0
4              39438    01                      NaN                0.0
...              ...   ...                      ...                ...
20768          39440    0K  wangzhang20@hotmail.com                1.0
20769          39440    0K                      NaN                0.0
20770          39440    0K    suki1991127@gmail.com                1.0
20771          39440    0K                      NaN                1.0
20772          39440    0K                      NaN                0.0

[20773 rows x 4 columns]

In [11]:
df_Guardians = NVMailingList.rename(columns={'contacts.guardian': 'guardian'})

In [12]:
df_Guardians

       school_sis_id grade                    email  guardian
0              39438    01     shanks7289@yahoo.com       1.0
1              39438    01  Alonzoadams35@yahoo.com       1.0
2              39438    01                      NaN       0.0
3              39438    01      ms.adar90@gmail.com       1.0
4              39438    01                      NaN       0.0
...              ...   ...                      ...       ...
20768          39440    0K  wangzhang20@hotmail.com       1.0
20769          39440    0K                      NaN       0.0
20770          39440    0K    suki1991127@gmail.com       1.0
20771          39440    0K                      NaN       1.0
20772          39440    0K                      NaN       0.0

[20773 rows x 4 columns]

In [13]:
df_Guardians.grade.value_counts().sort_index()

01    2237
02    2555
03    2400
04    2468
05    2427
06    2420
07    2116
08    2176
0K    1974
Name: grade, dtype: int64

In [14]:
df_Guardians = df_Guardians.loc[df_Guardians['guardian'] == 1]

In [15]:
df_Guardians.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8360 entries, 0 to 20771
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   school_sis_id  8360 non-null   int64
 1   grade          8360 non-null   object
 2   email          7993 non-null   object
 3   guardian       8360 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 326.6+ KB

In [16]:
df_Guardians

       school_sis_id grade                    email  guardian
0              39438    01     shanks7289@yahoo.com       1.0
1              39438    01  Alonzoadams35@yahoo.com       1.0
3              39438    01      ms.adar90@gmail.com       1.0
6              39438    01    Apariciov37@gmail.com       1.0
11             39438    01  frankialaniss@yahoo.com       1.0
...              ...   ...                      ...       ...
20765          39440    0K       naummeet@gmail.com       1.0
20767          39440    0K  stephjliang@hotmail.com       1.0
20768          39440    0K  wangzhang20@hotmail.com       1.0
20770          39440    0K    suki1991127@gmail.com       1.0
20771          39440    0K                      NaN       1.0

[8360 rows x 4 columns]

In [17]:
# Make sure grade levels are precise, contacts.guardian == 1, get ride of Relationship if not 1

In [18]:
df_Guardians = df_Guardians.reset_index(drop=True)

In [19]:
df_Guardians.grade.value_counts().sort_index()

01     933
02    1035
03    1034
04     955
05     962
06     932
07     806
08     807
0K     896
Name: grade, dtype: int64

In [20]:
df_Guardians.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8360 entries, 0 to 8359
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   school_sis_id  8360 non-null   int64
 1   grade          8360 non-null   object
 2   email          7993 non-null   object
 3   guardian       8360 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 261.4+ KB

In [21]:
# Drop Null Email

In [22]:
df_GuardiansEmails = df_Guardians.dropna(subset=['email'])

In [23]:
df_GuardiansEmails.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7993 entries, 0 to 8358
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   school_sis_id  7993 non-null   int64
 1   grade          7993 non-null   object
 2   email          7993 non-null   object
 3   guardian       7993 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 312.2+ KB

In [24]:
df_GuardiansEmails.grade.value_counts().sort_index()

01    902
02    991
03    985
04    899
05    925
06    888
07    771
08    770
0K    862
Name: grade, dtype: int64

In [25]:
df_GuardiansEmails.count()

school_sis_id    7993
grade            7993
email            7993
guardian         7993
dtype: int64

In [26]:
df_GuardiansEmails

      school_sis_id grade                    email  guardian
0             39438    01     shanks7289@yahoo.com       1.0
1             39438    01  Alonzoadams35@yahoo.com       1.0
2             39438    01      ms.adar90@gmail.com       1.0
3             39438    01    Apariciov37@gmail.com       1.0
4             39438    01  frankialaniss@yahoo.com       1.0
...             ...   ...                      ...       ...
8354          39440    0K        sky1185@gmail.com       1.0
8355          39440    0K       naummeet@gmail.com       1.0
8356          39440    0K  stephjliang@hotmail.com       1.0
8357          39440    0K  wangzhang20@hotmail.com       1.0
8358          39440    0K    suki1991127@gmail.com       1.0

[7993 rows x 4 columns]

In [27]:
df_GuardiansEmails

      school_sis_id grade                    email  guardian
0             39438    01     shanks7289@yahoo.com       1.0
1             39438    01  Alonzoadams35@yahoo.com       1.0
2             39438    01      ms.adar90@gmail.com       1.0
3             39438    01    Apariciov37@gmail.com       1.0
4             39438    01  frankialaniss@yahoo.com       1.0
...             ...   ...                      ...       ...
8354          39440    0K        sky1185@gmail.com       1.0
8355          39440    0K       naummeet@gmail.com       1.0
8356          39440    0K  stephjliang@hotmail.com       1.0
8357          39440    0K  wangzhang20@hotmail.com       1.0
8358          39440    0K    suki1991127@gmail.com       1.0

[7993 rows x 4 columns]

In [28]:
transform_grade = {
    '0K': 'KG',
    '01': '1',
    '02': '2',
    '03': '3',
    '04': '4',
    '05': '5',
    '06': '6',
    '07': '7',
    '08': '8',
}

df_GuardiansEmails['transformed_grade'] = df_GuardiansEmails['grade'].map(transform_grade)

C:\Users\LAUREN~1.GOL\AppData\Local\Temp/ipykernel_30880/2581383510.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_GuardiansEmails['transformed_grade'] = df_GuardiansEmails['grade'].map(transform_grade)

In [29]:
df_GuardiansEmails

      school_sis_id grade                    email  guardian transformed_grade
0             39438    01     shanks7289@yahoo.com       1.0                 1
1             39438    01  Alonzoadams35@yahoo.com       1.0                 1
2             39438    01      ms.adar90@gmail.com       1.0                 1
3             39438    01    Apariciov37@gmail.com       1.0                 1
4             39438    01  frankialaniss@yahoo.com       1.0                 1
...             ...   ...                      ...       ...               ...
8354          39440    0K        sky1185@gmail.com       1.0                KG
8355          39440    0K       naummeet@gmail.com       1.0                KG
8356          39440    0K  stephjliang@hotmail.com       1.0                KG
8357          39440    0K  wangzhang20@hotmail.com       1.0                KG
8358          39440    0K    suki1991127@gmail.com       1.0                KG

[7993 rows x 5 columns]

In [30]:
# Change column names, change grade values

In [31]:
df_GuardiansEmails.transformed_grade.value_counts().sort_index()

1     902
2     991
3     985
4     899
5     925
6     888
7     771
8     770
KG    862
Name: transformed_grade, dtype: int64

In [32]:
df_GuardiansEmails.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7993 entries, 0 to 8358
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   school_sis_id      7993 non-null   int64
 1   grade              7993 non-null   object
 2   email              7993 non-null   object
 3   guardian           7993 non-null   float64
 4   transformed_grade  7993 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 374.7+ KB

In [33]:
df_NVMailingList = df_GuardiansEmails.filter(['school_sis_id', 'transformed_grade', 'email'])

In [34]:
df_NVMailingList

      school_sis_id transformed_grade                    email
0             39438                 1     shanks7289@yahoo.com
1             39438                 1  Alonzoadams35@yahoo.com
2             39438                 1      ms.adar90@gmail.com
3             39438                 1    Apariciov37@gmail.com
4             39438                 1  frankialaniss@yahoo.com
...             ...               ...                      ...
8354          39440                KG        sky1185@gmail.com
8355          39440                KG       naummeet@gmail.com
8356          39440                KG  stephjliang@hotmail.com
8357          39440                KG  wangzhang20@hotmail.com
8358          39440                KG    suki1991127@gmail.com

[7993 rows x 3 columns]

In [35]:
df_NVMailingList.rename(columns={'transformed_grade':'grade'}, inplace=True)

In [36]:
df_NVMailingList

      school_sis_id grade                    email
0             39438     1     shanks7289@yahoo.com
1             39438     1  Alonzoadams35@yahoo.com
2             39438     1      ms.adar90@gmail.com
3             39438     1    Apariciov37@gmail.com
4             39438     1  frankialaniss@yahoo.com
...             ...   ...                      ...
8354          39440    KG        sky1185@gmail.com
8355          39440    KG       naummeet@gmail.com
8356          39440    KG  stephjliang@hotmail.com
8357          39440    KG  wangzhang20@hotmail.com
8358          39440    KG    suki1991127@gmail.com

[7993 rows x 3 columns]

<H5> take out Index, Write to a csv file

In [37]:
df_NVMailingList.to_csv('NVEmailAddresses.csv', index=False, encoding='utf-8')